DataProcessors/лб_ОбменСПлатежнымиСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>лб_ОбменСПлатежнымиСистемами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПапкаСФайлами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_НаправленияОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕстьОшибки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплатыПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисленоПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияСчетчика1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияСчетчика2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРеестра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_РазовыеПоУслугамЖКХ</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Реестры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаРеестра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/лб_НастройкиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_НастройкиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОплатыКУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаправлениеОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_НаправленияОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗагрузкаВыгрузка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.лб_ИмпортЭкспорт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаКода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПозицияКода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/лб_АлгоритмыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>лб_АлгоритмыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СбербанкСтелсисОТП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтаЛевобережье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтаКапремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтаКапремонтРФКР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/лб_ИмпортЭкспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>лб_ИмпортЭкспорт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаИЗагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>b</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/лб_ОбменСПлатежнымиСистемами/Ext/ObjectModule.bsl
Функция КонвертироватьDBF(Каталог, ИмяИсходногоФайла, ПолныйПутьКонвертированногоФайла, ТаблицаОшибок)
	
	Результат = Истина;
	
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("/export
						|/ExportType=DBF
						|/ExportMode=REPLACE+INSERT
						|/SuppressOverwriteOrDeletePrompt
						|/dbfVersion=3
						|/encoding=DBASE ENU CP437
						|/CloseWhenDone
						|/CloseOnError
						//|/ErrorHandlingType=Ignore
						|/IncludeColNames
						|/minimize
						|/IncludeMemo
						|/SrcDBKind=FOLDER
						|/SrcDBDriver=DBASE
						|/SrcDBInterface=ado");
	Текст.ДобавитьСтроку("/SrcDB="+Каталог);
	Текст.ДобавитьСтроку("/SrcTableName="+ИмяИсходногоФайла);
	
	Текст.ДобавитьСтроку("/TrgDB="+ПолныйПутьКонвертированногоФайла);
	
	Текст.Записать(Каталог + "convers.txt");
	
	КомандаFS = """C:\Program Files (x86)\Vitaliy Levchenko\Exportizer Pro 7\exptizer.exe"" /ParamsFile=" + """" + Каталог + "convers.txt""";
	
	//Текст.ДобавитьСтроку(";"+КомандаFS);
	//Текст.Записать("\\SRV1CV8\out\convers.txt");
		
		Попытка
		    WshShell=Новый COMОбъект("Wscript.Shell");
			WshShell.CurrentDirectory = Каталог;
	        sReturn = WshShell.run(КомандаFS,0,True);
			
			//КонвФайл = Новый Файл(ПолныйПутьКонвертированногоФайла);
			//ВремяЗавершенияОжидания = ТекущаяДата()+10;
			//Пока не КонвФайл.Существует() и ТекущаяДата() < ВремяЗавершенияОжидания Цикл
			//КонецЦикла;
			//Сообщить("Время ожидания - " + Строка(10 - (ВремяЗавершенияОжидания - ТекущаяДата())));
			//sReturn = WshShell.run("timeout 1",0,True);
	//КомандаFS = "copy """ + ПолныйПутьКонвертированногоФайла + """ ""\\SRV1CV8\out\filedb34.dbf""";
	//sReturn = WshShell.run(КомандаFS,0,True);
			
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка преобразования файла «%1»: %2.'"), Каталог + ИмяИсходногоФайла, ОписаниеОшибки());
			ЗафиксироватьОшибку(ТаблицаОшибок, ТекстСообщения);
		КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьДанныеИзКаталога(ИмяКаталога, НаправлениеОбмена, ДатаЗагрузки,ОбработкаОбъект) Экспорт 
	
	// !!! Временное сообщение. Удалить псле реализации процедур загрузок ТЧ из файлов.
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = НСтр("ru='Загрузка данных в табличную часть будет реализована на основе следующих листов требований'");
	//Сообщение.Сообщить();
	
	//ТаблицаОшибок - таблица для записи информации об ошибках при загрузке из файлов.
	КС = Новый КвалификаторыСтроки(1000);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);

	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("Ошибка", ОписаниеТиповС);
	ТаблицаОшибок.Колонки.Добавить("Рекомендации", ОписаниеТиповС);
	
	МассивФайлов = НайтиФайлы(ИмяКаталога, "*.DBF");
	
	Если МассивФайлов.Количество() = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='В каталоге «%1» не найдены файлы для загрузки.'"), ИмяКаталога);
		ЗафиксироватьОшибку(ТаблицаОшибок, ТекстСообщения);
	КонецЕсли;
	
	Сч = 1;
	Для Каждого Файл Из МассивФайлов Цикл
		
		НовоеИмяФайла = Лев(Файл.ИмяБезРасширения, 5) + Сч + ".DBF";
		ПолныйПутьКопииФайла = Файл.Путь + НовоеИмяФайла;
		КопироватьФайл(Файл.ПолноеИмя, ПолныйПутьКопииФайла);
		
		ФайлДБФ = Новый XBASE;
//------------------------------
		//ФайлДБФ.Кодировка = КодировкаXBase.ANSI;
		ФайлДБФ.Кодировка = КодировкаXBase.OEM;
//------------------------------
		
		ФайлОткрыт = Ложь;
		Попытка
			ФайлДБФ.ОткрытьФайл(ПолныйПутьКопииФайла);  
			ФайлОткрыт = Истина;
		Исключение
		КонецПопытки;
		
		Если не ФайлОткрыт Тогда
			
			ПолныйПутьКонвертированногоФайла = Файл.Путь + "filedb3.dbf";
			//ПолныйПутьКонвертированногоФайла = "\\SRV1CV8\out\1\filedb3.dbf";

			КонвертироватьDBF(Файл.Путь, НовоеИмяФайла, ПолныйПутьКонвертированногоФайла, ТаблицаОшибок);
			Попытка
				ФайлДБФ = Новый XBASE;
				ФайлДБФ.Кодировка = КодировкаXBase.OEM;
				ФайлДБФ.ОткрытьФайл(ПолныйПутьКонвертированногоФайла);  
				ФайлОткрыт = Истина;
			Исключение
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка при открытии файла «%1»: %2.'"), СокрЛП(Файл.Имя), ОписаниеОшибки());
				ЗафиксироватьОшибку(ТаблицаОшибок, ТекстСообщения);
			КонецПопытки;
			
		КонецЕсли;
		
		//Попытка
			ЗагрузитьИзФайла(ФайлДБФ, ТаблицаОшибок, Файл.Имя,ОбработкаОбъект);
		//Исключение
		//	//ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка при открытии файла «%1»: %2.'"), СокрЛП(Файл.Имя), ОписаниеОшибки());
		//	//ЗафиксироватьОшибку(ТаблицаОшибок, ТекстСообщения);
		//КонецПопытки;
		Сч = Сч + 1;
		
	КонецЦикла;
	
	Возврат ТаблицаОшибок;
	
КонецФункции

Функция НайтиЛС(ЛССтрока)
	ЛССтрока = СокрЛП(ЛССтрока);
	ЛС = "";
	
	Если не ПустаяСтрока(ЛССтрока) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|    бит_ЛицевыеСчета.Ссылка
		|ИЗ
		|    Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|
		|ГДЕ
		|    бит_ЛицевыеСчета.Наименование ПОДОБНО &Наименование";

		Запрос.УстановитьПараметр("Наименование", ЛССтрока + "%");

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		ЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
		НайденоЛС = 0;
		НайденоАрхивныхЛС = 0;
		Если Результат.Пустой() Тогда
		Иначе
			//Отбор = Новый Структура("Наименование");
			//Отбор.Наименование = ЛССтрока;
			//Выборка = Справочники.бит_ЛицевыеСчета.Выбрать(,,Отбор,);
			Пока Выборка.Следующий()  Цикл
				Если не Выборка.Ссылка.Архивный Тогда
				    ЛС = Выборка.Ссылка;
					НайденоЛС = НайденоЛС + 1;
				ИначеЕсли Выборка.Ссылка.Архивный и ЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда
				    ЛС = Выборка.Ссылка;
					НайденоАрхивныхЛС = НайденоАрхивныхЛС + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если (НайденоЛС + НайденоАрхивныхЛС) = 0 Тогда
			ЛС = "не найден ЛС " + ЛССтрока;
		ИначеЕсли НайденоЛС = 1 Тогда
		ИначеЕсли НайденоЛС = 0 и НайденоАрхивныхЛС = 1 Тогда
		ИначеЕсли НайденоЛС > 1 или НайденоАрхивныхЛС > 1 Тогда
			ЛС = "найдено несколько ЛС " + ЛССтрока;
		КонецЕсли;
			
		//ЛС = Справочники.бит_ЛицевыеСчета.НайтиПоНаименованию(ЛССтрока);
		//Если не ПустаяСтрока(ЛССтрока) Тогда
		//	Если ЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда
		//		ЛС = "";
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	Возврат ЛС; 
КонецФункции

Функция ПолучитьПериодНачисления(ФайлДБФ,ОбработкаОбъект)
	Год = 0;
	Месяц = 0;
	Если ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.СбербанкСтелсисОТП Тогда
		Год = ФайлДБФ.GOD;
		Месяц = ФайлДБФ.MES;
	ИначеЕсли ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаЛевобережье
		или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонт
		или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонтРФКР Тогда
		Месяц = Число(Сред(ФайлДБФ.PER_PLAT,1,2));
		Год = Число("20" + Сред(ФайлДБФ.PER_PLAT,3,2));
	КонецЕсли;
	
	
	Если Год = 0 или Месяц = 0 Тогда
		Год = 1;
		Месяц = 1;
	КонецЕсли;
	
	Возврат Дата(Год,Месяц,1); 
КонецФункции

Функция ПолучитьДатуОплаты(ФайлДБФ,ОбработкаОбъект)
	ДатаОплаты = Дата(1,1,1);
	Если ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.СбербанкСтелсисОТП Тогда
		ДатаОплаты = ФайлДБФ.DOP;
	ИначеЕсли ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаЛевобережье
		или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонт
		или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонтРФКР Тогда
		ДатаОплаты = ФайлДБФ.DATA;
	КонецЕсли;
	
	Возврат ДатаОплаты; 
КонецФункции

Функция НайтиУслугу(НомерСуммы, ОбработкаОбъект, ФайлДБФ)
	
	ОписаниеУслуги = Новый Структура("Услуга,ЭтоПени,УслугаНайдена");
	//Если не ПустаяСтрока(ЛССтрока) Тогда
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	лб_НастройкиОбмена.ИдентификаторПоставщика КАК ИдентификаторПоставщика,
	|	лб_НастройкиОбмена.СтрокаКода КАК СтрокаКода,
	|	лб_НастройкиОбмена.ПозицияКода КАК ПозицияКода,
	|	лб_НастройкиОбмена.УслугаЖКХ КАК УслугаЖКХ,
	|	лб_НастройкиОбмена.ВариантУслуги КАК ВариантУслуги,
	|	лб_НастройкиОбмена.ЭтоПени КАК ЭтоПени,
	|	лб_НастройкиОбмена.Основная КАК Основная
	|ИЗ
	|	РегистрСведений.лб_НастройкиОбмена КАК лб_НастройкиОбмена
	|ГДЕ
	|	(лб_НастройкиОбмена.ЗагрузкаВыгрузка = Значение(Перечисление.лб_ИмпортЭкспорт.Загрузка) или
	|		лб_НастройкиОбмена.ЗагрузкаВыгрузка = Значение(Перечисление.лб_ИмпортЭкспорт.ВыгрузкаИЗагрузка)) и
	|   лб_НастройкиОбмена.НаправлениеОбмена = &НаправлениеОбмена и
	|	лб_НастройкиОбмена.НомерПоля =  &НомерПоля
	|");
    
    Запрос.УстановитьПараметр("НомерПоля",НомерСуммы); 
    Запрос.УстановитьПараметр("НаправлениеОбмена",ОбработкаОбъект.НаправлениеОбмена);	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	//Выборка = Запрос.Выполнить().Выбрать();
	
	Если Результат.Пустой() Тогда
		ОписаниеУслуги.Услуга = "Не найдена услуга, где НомерПоля=" + НомерСуммы;
		ОписаниеУслуги.ЭтоПени = Ложь;
		ОписаниеУслуги.УслугаНайдена = Ложь;
	ИначеЕсли Выборка.Количество() = 1 Тогда
		Пока Выборка.Следующий() Цикл
			ОписаниеУслуги.Услуга =  Выборка.УслугаЖКХ;
			ОписаниеУслуги.ЭтоПени = Выборка.ЭтоПени;
			ОписаниеУслуги.УслугаНайдена = Истина;
		КонецЦикла;
	Иначе
		
		ТаблицаНастроек = Результат.Выгрузить();
		
		Если ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.СбербанкСтелсисОТП Тогда
			ПолеIDORG = ФайлДБФ.поля.Найти("IDORG"+НомерСуммы);
			Если не ПолеIDORG = Неопределено Тогда
				Если не ФайлДБФ[ПолеIDORG.Имя] = 0 Тогда
					Отбор = Новый Структура("ИдентификаторПоставщика");
					Отбор.ИдентификаторПоставщика = ФайлДБФ[ПолеIDORG.Имя];
					ТаблицаНастроек = ТаблицаНастроек.Скопировать(Отбор);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаЛевобережье
			или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонт
			или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонтРФКР Тогда
			
			ТаблицаНастроек.Колонки.Добавить("ПравильнаяСтрока");
			Для каждого СтрокаТаблицы из ТаблицаНастроек Цикл
				
				Если СтрокаТаблицы.СтрокаКода = 1 Тогда
					ИмяПоляНастройки = "KOD_SPR";
				Иначе
					ИмяПоляНастройки = "KOD_SPR1";
				КонецЕсли;
				СтрокаНастройки = ФайлДБФ[ИмяПоляНастройки];
				Если не ПустаяСтрока(СтрокаНастройки) Тогда
					ИдентификаторПоставщика = Число(Сред(СтрокаНастройки,СтрокаТаблицы.ПозицияКода,1));
					Если СтрокаТаблицы.ИдентификаторПоставщика = ИдентификаторПоставщика
						или СтрокаТаблицы.ИдентификаторПоставщика <= 0 Тогда
						СтрокаТаблицы.ПравильнаяСтрока = Истина;
					Иначе
						СтрокаТаблицы.ПравильнаяСтрока = Ложь;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Отбор = Новый Структура("ПравильнаяСтрока");
			Отбор.ПравильнаяСтрока = Истина;
			ТаблицаНастроек = ТаблицаНастроек.Скопировать(Отбор);
			
		КонецЕсли;
		
		Если ТаблицаНастроек.Количество() = 1 Тогда
			ОписаниеУслуги.Услуга =  ТаблицаНастроек[0].УслугаЖКХ;
			ОписаниеУслуги.ЭтоПени = ТаблицаНастроек[0].ЭтоПени;
			ОписаниеУслуги.УслугаНайдена = Истина;
		Иначе
			ТаблицаНастроек.Свернуть("УслугаЖКХ, ЭтоПени");
		
			Если ТаблицаНастроек.Количество() = 1 Тогда
				ОписаниеУслуги.Услуга =  ТаблицаНастроек[0].УслугаЖКХ;
				ОписаниеУслуги.ЭтоПени = ТаблицаНастроек[0].ЭтоПени;
				ОписаниеУслуги.УслугаНайдена = Истина;
			Иначе
				СписокУслуг = "";
				ЭтоПервая = Истина;
				Для каждого Строка Из ТаблицаНастроек Цикл
					СписокУслуг = СписокУслуг + ?(не ЭтоПервая,",", "") + Строка.УслугаЖКХ + ?(Строка.ЭтоПени, "(пени)","");
					ЭтоПервая = Ложь;
				КонецЦикла;
				ОписаниеУслуги.Услуга =  "Подходит несколько услуг: " + СписокУслуг;
				ОписаниеУслуги.ЭтоПени = 0;
				ОписаниеУслуги.УслугаНайдена = Ложь;
				
			КонецЕсли;
			 
		КонецЕсли;
			
	КонецЕсли;
	Возврат ОписаниеУслуги; 
КонецФункции

Функция ПроверитьСтруктуруФайла(ФайлДБФ, ТаблицаОшибок, ИмяФайлаРеестра, ОбработкаОбъект)
	Результат = Истина;
	ПоляДляПроверки = Новый Массив();
	
	Если ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.СбербанкСтелсисОТП Тогда
		
		ПоляДляПроверки.Добавить("LS");
		ПоляДляПроверки.Добавить("GOD");
		ПоляДляПроверки.Добавить("MES");
		ПоляДляПроверки.Добавить("DOP");
		
	ИначеЕсли ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаЛевобережье
		или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонт
		или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонтРФКР Тогда
		
		ПоляДляПроверки.Добавить("LS");
		ПоляДляПроверки.Добавить("PER_PLAT");
		ПоляДляПроверки.Добавить("DATA");
		ПоляДляПроверки.Добавить("KOD_SPR");
		ПоляДляПроверки.Добавить("KOD_SPR1");
		
	КонецЕсли;
	
	Для Каждого ИмяПоля из ПоляДляПроверки Цикл
		Поле = ФайлДБФ.поля.Найти(ИмяПоля);
		Если Поле = Неопределено Тогда
			Результат = Ложь;
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Реестр %1 не соответствует структуре обмена ""%2"": отсутствует поле %3.'"), ИмяФайлаРеестра, ОбработкаОбъект.НаправлениеОбмена, ИмяПоля);
			ЗафиксироватьОшибку(ТаблицаОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат; 
КонецФункции

Процедура ЗагрузитьИзФайла(ФайлДБФ, ТаблицаОшибок, ИмяФайлаРеестра="",ОбработкаОбъект)
	
	// Для каждого реестра добавить строку в табличную часть "Реестры".
	// При добавлении новой строки в табличную часть "Данные" необходимо связать ее
	// со строкой Реестры по реквизиту ИдентификаторСтрокиРеестра = ИдентификаторСтроки.
	
	СтруктурыФайлаСоответствует = ПроверитьСтруктуруФайла(ФайлДБФ, ТаблицаОшибок, ИмяФайлаРеестра, ОбработкаОбъект);
	
	Если СтруктурыФайлаСоответствует Тогда
		Индекс = 0; 
		ИдентификаторСтрокиРеестра = 0;
		Для Каждого СтрокаТЧ Из ОбработкаОбъект.Реестры Цикл
			Индекс = Индекс + 1;
			ИдентификаторСтрокиРеестра = Индекс;
			
		КонецЦикла;
		НоваяСтрока = ОбработкаОбъект.Реестры.Добавить();
		НоваяСтрока.ИмяФайлаРеестра = ИмяФайлаРеестра;
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтрокиРеестра;
		
			
		ФайлДБФ.Первая();
		Пока не ФайлДБФ.ВКонце() Цикл
			
			//чтнение информации из файла и добавление строк тч "Данные"
			
			НомерЛС = ФайлДБФ.LS;
			//Сообщить("" + НомерЛС + " " +СокрЛП(ФайлДБФ.ADR) + " " + СокрЛП(ФайлДБФ.FIO));
			ЛС = НайтиЛС(НомерЛС);
			ПериодНачисления = ПолучитьПериодНачисления(ФайлДБФ,ОбработкаОбъект);
			ДатаОплаты = ПолучитьДатуОплаты(ФайлДБФ,ОбработкаОбъект);
			
			//Поиск элемента справочника
			//....
			Для каждого ПолеDBF из ФайлДБФ.поля Цикл
				
				Если (Лев(ВРег(ПолеDBF.Имя), 5) = "SUMMA" и ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.СбербанкСтелсисОТП)
					или ((Лев(ВРег(ПолеDBF.Имя), 5) = "SUMMA") или (Лев(ВРег(ПолеDBF.Имя), 5) = "SUM_P")
							и (ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.СбербанкСтелсисОТП
								или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонт
								или ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.ПочтаКапремонтРФКР
							   )
						)
					Тогда
					Если СтрДлина(ПолеDBF.Имя) <= 5 Тогда
						Продолжить;
					КонецЕсли;
					
					СуммаОплаты = ФайлДБФ[ПолеDBF.Имя];
					Если не СуммаОплаты = 0 Тогда
						НомерСуммы = Число(Сред(ПолеDBF.Имя,6));
						ОписаниеУслуги = НайтиУслугу(НомерСуммы, ОбработкаОбъект, ФайлДБФ);
						
						СуммаКомиссии = 0;
						Если ОбработкаОбъект.НаправлениеОбмена.АлгоритмЗагрузки = Перечисления.лб_АлгоритмыОбмена.СбербанкСтелсисОТП Тогда
							ПолеSNN = ФайлДБФ.поля.Найти("S"+НомерСуммы);
							Если не ПолеSNN = Неопределено Тогда
								СуммаКомиссии = Число(ФайлДБФ[ПолеSNN.Имя]);
							КонецЕсли;
						КонецЕсли;
						
						//Добавление новой строки табличной части
						НоваяСтрока = ОбработкаОбъект.Данные.Добавить();
						НоваяСтрока.ЛицевойСчет = ЛС;
						НоваяСтрока.ИдентификаторСтрокиРеестра = ИдентификаторСтрокиРеестра;
						НоваяСтрока.ПериодНачисления = ПериодНачисления;
						НоваяСтрока.ДатаОплаты = ДатаОплаты;
						НоваяСтрока.Услуга = ОписаниеУслуги.Услуга;
						Если ОписаниеУслуги.УслугаНайдена Тогда
							Если ОписаниеУслуги.ЭтоПени Тогда
								НоваяСтрока.СуммаОплатыПени = СуммаОплаты;
							Иначе
								НоваяСтрока.СуммаОплаты = СуммаОплаты;
							КонецЕсли;
						Иначе
							НоваяСтрока.СуммаОплаты = СуммаОплаты;
						КонецЕсли;
						НоваяСтрока.СуммаКомиссии = СуммаКомиссии;
						
						Если не ТипЗнч(ЛС) = Тип("СправочникСсылка.бит_ЛицевыеСчета") или ЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка() или не ОписаниеУслуги.УслугаНайдена Тогда
							//Если что-то не найдено, добавляем информацию об ошибке в таблицу ошибок
							НоваяСтрока.ЕстьОшибки = Истина;
							Если не ТипЗнч(ЛС) = Тип("СправочникСсылка.бит_ЛицевыеСчета") или ЛС = Справочники.бит_ЛицевыеСчета.ПустаяСсылка() Тогда
								ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Реестр %1; строка №%2: Не найден номер лицевого счета %3.'"), ИмяФайлаРеестра, НоваяСтрока.НомерСтроки, НомерЛС);
								ЗафиксироватьОшибку(ТаблицаОшибок, ОписаниеОшибки);
							КонецЕсли;
							Если не ОписаниеУслуги.УслугаНайдена Тогда
								ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Реестр %1; строка №%2: %3.'"), ИмяФайлаРеестра, НоваяСтрока.НомерСтроки, ОписаниеУслуги.Услуга);
								ЗафиксироватьОшибку(ТаблицаОшибок, ОписаниеОшибки);
							КонецЕсли;
						КонецЕсли;
							
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			//....
			
			ФайлДБФ.Следующая();

		КонецЦикла;
		
	КонецЕсли;
	
	ФайлДБФ.ЗакрытьФайл();

КонецПроцедуры

Процедура ВыгрузитьДанныеВКаталог(ИмяКаталога, НаправлениеОбмена, ДатаНачала, ДатаОкончания, СписокЛС = Неопределено) Экспорт 
КонецПроцедуры

Процедура СоздатьДокументыОплат(Организация, ПредставлениеРеестра, Перезаписывать = Истина) Экспорт
КонецПроцедуры

Функция ПолучитьСписокАктивныхЛС(Дата, НачалоНомераЛС) Экспорт 
КонецФункции

Процедура ЗафиксироватьОшибку(ТаблицаОшибок, ТекстОшибки, ТекстРекомендации = "")
	
	НоваяОшибка = ТаблицаОшибок.Добавить();
	НоваяОшибка.Ошибка       = ТекстОшибки;
	НоваяОшибка.Рекомендации = ТекстРекомендации;
	
КонецПроцедуры
